{
    "LINKS": {
      "HOME": "الرئيسية",
      "EXPERINCE": "الخبرات",
      "WORKS": "الأعمال",
      "ME": "من أنا",
      "CONTACT": "اتصل بي",
      "EDUCATION": "التعليم",
      "COMMENTS": "الشهادات",
      "GAME": "الملعب"
    },
    "HOME":{
      "name": "مصطفى إيدر قاوي",
      "title": "مطور ويب متكامل",
      "highlight": "قابل للتوسع. عصري. سهل الصيانة. أحوّل الأفكار إلى كود نظيف ومرن — وأستمتع بكل جزء من ذلك.",
      "about_1": "أركز على بناء مواقع ويب قابلة للتوسع ومبنية على الأداء تقدم تجربة مستخدم ممتازة. أستخدم تقنيات مثل React لتطوير الواجهات الحديثة وNode.js لتشغيل الأنظمة الخلفية الموثوقة. الكود النظيف وسهولة الوصول والصيانة دائمًا في صميم ما أقدمه.",
      "about_2": "أهتم أيضًا بأساسيات تحسين محركات البحث (SEO) — وأعرف كيف أنظم المشاريع باستخدام Next.js لدعم الرؤية الأفضل والبنية والأداء في محركات البحث.",
      "location": "مقرّي في أكادير، المغرب · أكثر من سنتين من التعلم الذاتي والأكاديمي في تطوير الويب المتكامل."
    },
    "BUTTONS":{
      "home": "الرئيسية",
      "about": "من أنا",
      "projects": "المشاريع",
      "skills": "المهارات",
      "contact": "اتصل بي",
      "download_cv": "تحميل السيرة الذاتية",
      "hire_me": "وظفني",
      "view_more": "عرض المزيد",
      "back_to_top": "العودة للأعلى",
      "send_message": "إرسال الرسالة",
      "get_in_touch": "تواصل معي",
      "download_resume": "تحميل السيرة الذاتية",
      "view_portfolio": "عرض الأعمال",
      "lets_collaborate": "دعنا نتعاون",
      "schedule_call": "جدولة مكالمة",
      "subscribe_newsletter": "الاشتراك في النشرة",
      "read_blog": "قراءة المدونة",
      "follow_me": "تابعني",
      "testimonials": "شهادات العملاء",
      "expore_projects":"استعرض مشاريعي"

    },
    "EXPERINCE":{
      "introduction": "خلال أول تجربة تدريبية لي في Développeur-informatique.ma، اكتسبت مهارات ورؤى قيّمة شكلت نهجي في التطوير. إليك بعض النقاط الرئيسية:",
      "title": "تجربتي التدريبية الأولى في ",
      "sections": [
          {
              "subtitle": "Git ونظام التحكم في الإصدارات",
              "content": "اكتسبت خبرة عملية في إدارة المستودعات، التعامل مع الدمج، وحل تعارضات الشيفرة."
          },
          {
              "subtitle": "العمل الجماعي",
              "content": "تعلمت أهمية العمل ضمن فريق، تبادل الأفكار، وضمان التواصل السلس."
          },
          {
              "subtitle": "أمن الموقع الإلكتروني",
              "content": "ساهمت في تعزيز أمان الموقع الإلكتروني لضمان تجربة أكثر أمانًا للمستخدم."
          },
          {
              "subtitle": "تحسين الكود",
              "content": "ركزت على إنشاء كود قابل للتوسع وفعال، مع تبسيطه وتحسين أدائه."
          },
          {
              "subtitle": "تحسين مهارات اللغة الفرنسية",
              "content": "طورت مهاراتي في التواصل ضمن بيئة عمل ثنائية اللغة."
          },
          {
              "subtitle": "حل المشكلات والاحترافية",
              "content": "طورت مهارات قوية في حل المشكلات وتعلمت كيف أكون محترفًا في بيئة العمل."
          }
          
      ],
      "CONCLUSION":{
        "subtitle": "الخاتمة",
        "content": "قدمت لي هذه التجربة التدريبية أساسًا قويًا في تطوير الويب والعمل الجماعي والاحترافية، أواصل البناء عليه في مسيرتي المهنية."
    }
  },
  "EXPER2": {
    "title": "الخبرة كمستقل - مشروع التجارة الإلكترونية",
    "introduction": "انضممت إلى فريق عمل مستقل عبر الإنترنت لتطوير موقع تجارة إلكترونية لمتجر متخصص في الهواتف والإلكترونيات. أتاح لي هذا المشروع عن بُعد العمل في كل من التطوير وتصميم واجهة المستخدم، باستخدام Figma لإنشاء واجهات نظيفة وسهلة الاستخدام تتماشى مع هوية العميل. من خلال هذه التجربة، حسّنت من إدارة وقتي، وشاركت في اجتماعات منتظمة، وأتممت المهام في الوقت المحدد، وتواصلت مباشرة مع العميل لضمان تلبية احتياجاته بكفاءة ومهنية.",
    "key_takeaways_title": "أهم المكتسبات",
    "key_takeaways": [
        "اكتسبت خبرة في العمل عن بُعد ضمن فريق مستقل.",
        "تعلمت كيفية إدارة الاجتماعات واحترام المواعيد النهائية.",
        "إنجاز المهام بكفاءة مع الحفاظ على الجودة.",
        "التواصل المباشر مع العملاء لفهم احتياجاتهم وملاحظاتهم.",
        "المساهمة في تصميم واجهة المستخدم وتجربة المستخدم باستخدام Figma، مما حسّن الواجهة والتجربة.",
        "تحسين الانضباط الذاتي وتحمل المسؤولية في بيئة العمل عن بُعد."
    ]
},
"EXPER3":{
  "title": "الالتزام الشخصي بالنمو",
  "introduction": "على مدار العامين الماضيين في ISTA أكادير، اتبعت نهجًا استباقيًا في تطوير نفسي كمطور Full Stack. رغم أن تعليمي الرسمي وفر لي الأساس، إلا أنني أدركت مبكرًا أن الإتقان الحقيقي يتطلب التزامًا يوميًا يتجاوز الفصول الدراسية.",
  "body": "كل يوم، كنت أشارك في تعلم ذاتي، أستكشف تقنيات جديدة، وأبني مشاريع، وأعمق فهمي لتطوير الواجهات الأمامية والخلفية. هذا الجهد المستمر لم يعزز فقط مهاراتي التقنية، بل ساعد أيضًا في تكوين عقلية التحسين المستمر والتكيف."
},
"ERRORS": {
  "PAGE_UNDER_CONSTRUCTURE": "قريباً | أعمل على شيء رائع",
  "PAGE_UNDER_CONSTRUCTURE2": "أقوم حالياً بالعمل على هذه الصفحة لتحسينها. عد لاحقاً للاطلاع على التحديثات!"
}

,
"PROJECTS":{
  "PROBELM":"المشكلة",
  "SOLUTION":"الحل ",
  "KEYAWAYS":"الاستخلاصات",
  "TECHUSED":"التقنيات المستخدمة",
  "CHANLLANGES":"التحديات"



} 


  }
 
  